talhahisham92/lowleveldriverdevelopment/RX63T_GPT_driver/RX63T_GPT_driver/iodefine.h
struct st_gpt {
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :8;
            unsigned char :4;
            unsigned char CST3:1;
            unsigned char CST2:1;
            unsigned char CST1:1;
            unsigned char CST0:1;
        } BIT;
    } GTSTR;
    char           wk0[2];
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char CPHW3:2;
            unsigned char CPHW2:2;
            unsigned char CPHW1:2;
            unsigned char CPHW0:2;
            unsigned char CSHW3:2;
            unsigned char CSHW2:2;
            unsigned char CSHW1:2;
            unsigned char CSHW0:2;
        } BIT;
    } GTHSCR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :4;
            unsigned char CCSW3:1;
            unsigned char CCSW2:1;
            unsigned char CCSW1:1;
            unsigned char CCSW0:1;
            unsigned char CCHW3:2;
            unsigned char CCHW2:2;
            unsigned char CCHW1:2;
            unsigned char CCHW0:2;
        } BIT;
    } GTHCCR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char CSHSL3:4;
            unsigned char CSHSL2:4;
            unsigned char CSHSL1:4;
            unsigned char CSHSL0:4;
        } BIT;
    } GTHSSR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char CSHPL3:4;
            unsigned char CSHPL2:4;
            unsigned char CSHPL1:4;
            unsigned char CSHPL0:4;
        } BIT;
    } GTHPSR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :8;
            unsigned char :4;
            unsigned char WP3:1;
            unsigned char WP2:1;
            unsigned char WP1:1;
            unsigned char WP0:1;
        } BIT;
    } GTWP;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :2;
            unsigned char SYNC3:2;
            unsigned char :2;
            unsigned char SYNC2:2;
            unsigned char :2;
            unsigned char SYNC1:2;
            unsigned char :2;
            unsigned char SYNC0:2;
        } BIT;
    } GTSYNC;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :6;
            unsigned char ETINF:1;
            unsigned char ETIPF:1;
            unsigned char :6;
            unsigned char ETINEN:1;
            unsigned char ETIPEN:1;
        } BIT;
    } GTETINT;
    char           wk1[2];
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char BD33:1;
            unsigned char BD32:1;
            unsigned char BD31:1;
            unsigned char BD30:1;
            unsigned char BD23:1;
            unsigned char BD22:1;
            unsigned char BD21:1;
            unsigned char BD20:1;
            unsigned char BD13:1;
            unsigned char BD12:1;
            unsigned char BD11:1;
            unsigned char BD10:1;
            unsigned char BD03:1;
            unsigned char BD02:1;
            unsigned char BD01:1;
            unsigned char BD00:1;
        } BIT;
    } GTBDR;
    char           wk2[2];
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned short :12;
            unsigned short SWP3:1;
            unsigned short SWP2:1;
            unsigned short SWP1:1;
            unsigned short SWP0:1;
        } BIT;
    } GTSWP;
    char           wk3[102];
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char LPSC:2;
            unsigned char TPSC:2;
            unsigned char LCNTAT:1;
            unsigned char LCTO:3;
            unsigned char :1;
            unsigned char LCINTO:1;
            unsigned char LCINTD:1;
            unsigned char LCINTC:1;
            unsigned char :1;
            unsigned char LCNTS:1;
            unsigned char LCNTCR:1;
            unsigned char LCNTE:1;
        } BIT;
    } LCCR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :8;
            unsigned char :5;
            unsigned char LISO:1;
            unsigned char LISD:1;
            unsigned char LISC:1;
        } BIT;
    } LCST;
    unsigned short LCNT;
    unsigned short LCNTA;
    unsigned short LCNT00;
    unsigned short LCNT01;
    unsigned short LCNT02;
    unsigned short LCNT03;
    unsigned short LCNT04;
    unsigned short LCNT05;
    unsigned short LCNT06;
    unsigned short LCNT07;
    unsigned short LCNT08;
    unsigned short LCNT09;
    unsigned short LCNT10;
    unsigned short LCNT11;
    unsigned short LCNT12;
    unsigned short LCNT13;
    unsigned short LCNT14;
    unsigned short LCNT15;
    unsigned short LCNTDU;
    unsigned short LCNTDL;
};

struct st_gpt0 {
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char OBHLD:1;
            unsigned char OBDFLT:1;
            unsigned char GTIOB:6;
            unsigned char OAHLD:1;
            unsigned char OADFLT:1;
            unsigned char GTIOA:6;
        } BIT;
    } GTIOR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char ADTRBDEN:1;
            unsigned char ADTRBUEN:1;
            unsigned char ADTRADEN:1;
            unsigned char ADTRAUEN:1;
            unsigned char EINT:1;
            unsigned char :3;
            unsigned char GTINTPR:2;
            unsigned char GTINTF:1;
            unsigned char GTINTE:1;
            unsigned char GTINTD:1;
            unsigned char GTINTC:1;
            unsigned char GTINTB:1;
            unsigned char GTINTA:1;
        } BIT;
    } GTINTAD;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :2;
            unsigned char CCLR:2;
            unsigned char :2;
            unsigned char TPCS:2;
            unsigned char :5;
            unsigned char MD:3;
        } BIT;
    } GTCR;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :1;
            unsigned char ADTDB:1;
            unsigned char ADTTB:2;
            unsigned char :1;
            unsigned char ADTDA:1;
            unsigned char ADTTA:2;
            unsigned char :1;
            unsigned char CCRSWT:1;
            unsigned char PR:2;
            unsigned char CCRB:2;
            unsigned char CCRA:2;
        } BIT;
    } GTBER;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :8;
            unsigned char :6;
            unsigned char UDF:1;
            unsigned char UD:1;
        } BIT;
    } GTUDC;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :1;
            unsigned char ADTBL:1;
            unsigned char :1;
            unsigned char ADTAL:1;
            unsigned char :1;
            unsigned char IVTT:3;
            unsigned char IVTC:2;
            unsigned char ITLF:1;
            unsigned char ITLE:1;
            unsigned char ITLD:1;
            unsigned char ITLC:1;
            unsigned char ITLB:1;
            unsigned char ITLA:1;
        } BIT;
    } GTITC;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char TUCF:1;
            unsigned char :3;
            unsigned char DTEF:1;
            unsigned char ITCNT:3;
            unsigned char TCFPU:1;
            unsigned char TCFPO:1;
            unsigned char TCFF:1;
            unsigned char TCFE:1;
            unsigned char TCFD:1;
            unsigned char TCFC:1;
            unsigned char TCFB:1;
            unsigned char TCFA:1;
        } BIT;
    } GTST;
    unsigned short GTCNT;
    unsigned short GTCCRA;
    unsigned short GTCCRB;
    unsigned short GTCCRC;
    unsigned short GTCCRD;
    unsigned short GTCCRE;
    unsigned short GTCCRF;
    unsigned short GTPR;
    unsigned short GTPBR;
    unsigned short GTPDBR;
    char           wk0[2];
    unsigned short GTADTRA;
    unsigned short GTADTBRA;
    unsigned short GTADTDBRA;
    char           wk1[2];
    unsigned short GTADTRB;
    unsigned short GTADTBRB;
    unsigned short GTADTDBRB;
    char           wk2[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short OBE:1;
            unsigned short OAE:1;
            unsigned short :1;
            unsigned short SWN:1;
            unsigned short :3;
            unsigned short NFV:1;
            unsigned short NFS:4;
            unsigned short NVB:1;
            unsigned short NVA:1;
            unsigned short NEB:1;
            unsigned short NEA:1;
        } BIT;
    } GTONCR;
    union {
        unsigned short WORD;
        struct {
            unsigned short :7;
            unsigned short TDFER:1;
            unsigned short :2;
            unsigned short TDBDE:1;
            unsigned short TDBUE:1;
            unsigned short :3;
            unsigned short TDE:1;
        } BIT;
    } GTDTCR;
    unsigned short GTDVU;
    unsigned short GTDVD;
    unsigned short GTDBU;
    unsigned short GTDBD;
    union {
        unsigned short WORD;
        struct {
            unsigned short :14;
            unsigned short SOS:2;
        } BIT;
    } GTSOS;
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short SOTR:1;
        } BIT;
    } GTSOTR;
};

struct st_icu {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IR:1;
        } BIT;
    } IR[253];
    char           wk0[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DTCE:1;
        } BIT;
    } DTCER[252];
    char           wk1[4];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IEN7:1;
            unsigned char IEN6:1;
            unsigned char IEN5:1;
            unsigned char IEN4:1;
            unsigned char IEN3:1;
            unsigned char IEN2:1;
            unsigned char IEN1:1;
            unsigned char IEN0:1;
        } BIT;
    } IER[32];
    char           wk2[192];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SWINT:1;
        } BIT;
    } SWINTR;
    char           wk3[15];
    union {
        unsigned short WORD;
        struct {
            unsigned short FIEN:1;
            unsigned short :7;
            unsigned short FVCT:8;
        } BIT;
    } FIR;
    char           wk4[14];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char IPR:4;
        } BIT;
    } IPR[251];
    char           wk5[5];
    unsigned char  DMRSR0;
    char           wk6[3];
    unsigned char  DMRSR1;
    char           wk7[3];
    unsigned char  DMRSR2;
    char           wk8[3];
    unsigned char  DMRSR3;
    char           wk9[243];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char IRQMD:2;
        } BIT;
    } IRQCR[6];
    char           wk10[10];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char FLTEN5:1;
            unsigned char FLTEN4:1;
            unsigned char FLTEN3:1;
            unsigned char FLTEN2:1;
            unsigned char FLTEN1:1;
            unsigned char FLTEN0:1;
        } BIT;
    } IRQFLTE0;
    char           wk11[3];
    union {
        unsigned short WORD;
        struct {
            unsigned short :4;
            unsigned short FCLKSEL5:2;
            unsigned short FCLKSEL4:2;
            unsigned short FCLKSEL3:2;
            unsigned short FCLKSEL2:2;
            unsigned short FCLKSEL1:2;
            unsigned short FCLKSEL0:2;
        } BIT;
    } IRQFLTC0;
    char           wk12[106];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2ST:1;
            unsigned char LVD1ST:1;
            unsigned char IWDTST:1;
            unsigned char WDTST:1;
            unsigned char OSTST:1;
            unsigned char NMIST:1;
        } BIT;
    } NMISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2EN:1;
            unsigned char LVD1EN:1;
            unsigned char IWDTEN:1;
            unsigned char WDTEN:1;
            unsigned char OSTEN:1;
            unsigned char NMIEN:1;
        } BIT;
    } NMIER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2CLR:1;
            unsigned char LVD1CLR:1;
            unsigned char IWDTCLR:1;
            unsigned char WDTCLR:1;
            unsigned char OSTCLR:1;
            unsigned char NMICLR:1;
        } BIT;
    } NMICLR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char NMIMD:1;
        } BIT;
    } NMICR;
    char           wk13[12];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char NFLTEN:1;
        } BIT;
    } NMIFLTE;
    char           wk14[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char NFCLKSEL:2;
        } BIT;
    } NMIFLTC;
    char           wk15[19819];
    union {
        unsigned long LONG;
        struct {
            unsigned long :26;
            unsigned long IS5:1;
            unsigned long IS4:1;
            unsigned long :2;
            unsigned long IS1:1;
            unsigned long IS0:1;
        } BIT;
    } GRP[13];
    char           wk16[12];
    union {
        unsigned long LONG;
        struct {
            unsigned long :26;
            unsigned long EN5:1;
            unsigned long EN4:1;
            unsigned long :2;
            unsigned long EN1:1;
            unsigned long EN0:1;
        } BIT;
    } GEN[13];
};

