talhahisham92/lowleveldriverdevelopment/RX63T_GPT_driver/RX63T_GPT_driver/iodefine.h
struct st_iwdt {
    unsigned char  IWDTRR;
    char           wk0[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :2;
            unsigned short RPSS:2;
            unsigned short :2;
            unsigned short RPES:2;
            unsigned short CKS:4;
            unsigned short :2;
            unsigned short TOPS:2;
        } BIT;
    } IWDTCR;
    union {
        unsigned short WORD;
        struct {
            unsigned short REFEF:1;
            unsigned short UNDFF:1;
            unsigned short CNTVAL:14;
        } BIT;
    } IWDTSR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RSTIRQS:1;
        } BIT;
    } IWDTRCR;
    char           wk1[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char SLCSTP:1;
        } BIT;
    } IWDTCSTPR;
};

struct st_mpc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char B0WI:1;
            unsigned char PFSWE:1;
        } BIT;
    } PWPR;
    char           wk0[32];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P00PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P01PFS;
    char           wk1[6];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P10PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P11PFS;
    char           wk2[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P22PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P23PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P24PFS;
    char           wk3[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P30PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P31PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P32PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P33PFS;
    char           wk4[4];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P40PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P41PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P42PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P43PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P44PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P45PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P46PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P47PFS;
    char           wk5[16];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P70PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P71PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P72PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P73PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P74PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P75PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P76PFS;
    char           wk6[10];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P91PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P92PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } P93PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } P94PFS;
    char           wk7[5];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PA2PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PA3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PA4PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PA5PFS;
    char           wk8[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB0PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB1PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB2PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } PB4PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :2;
            unsigned char PSEL:4;
        } BIT;
    } PB5PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PB7PFS;
    char           wk9[11];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PD3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PD4PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PD5PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PD6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PD7PFS;
    char           wk10[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char PSEL:4;
        } BIT;
    } PE2PFS;
};

struct st_mpu {
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE0;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE0;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE1;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE1;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE2;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE2;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE3;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE3;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE4;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE4;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE5;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE5;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE6;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE6;
    union {
        unsigned long LONG;
        struct {
            unsigned long RSPN:28;
        } BIT;
    } RSPAGE7;
    union {
        unsigned long LONG;
        struct {
            unsigned long REPN:28;
            unsigned long UAC:3;
            unsigned long V:1;
        } BIT;
    } REPAGE7;
    char           wk0[192];
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long MPEN:1;
        } BIT;
    } MPEN;
    union {
        unsigned long LONG;
        struct {
            unsigned long :28;
            unsigned long UBAC:3;
        } BIT;
    } MPBAC;
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long CLR:1;
        } BIT;
    } MPECLR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :29;
            unsigned long DRW:1;
            unsigned long DA:1;
            unsigned long IA:1;
        } BIT;
    } MPESTS;
    char           wk1[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long DEA:32;
        } BIT;
    } MPDEA;
    char           wk2[8];
    union {
        unsigned long LONG;
        struct {
            unsigned long SA:32;
        } BIT;
    } MPSA;
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short S:1;
        } BIT;
    } MPOPS;
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short INV:1;
        } BIT;
    } MPOPI;
    union {
        unsigned long LONG;
        struct {
            unsigned long :8;
            unsigned long HITI:8;
            unsigned long :12;
            unsigned long UHACI:3;
        } BIT;
    } MHITI;
    union {
        unsigned long LONG;
        struct {
            unsigned long :8;
            unsigned long HITD:8;
            unsigned long :12;
            unsigned long UHACD:3;
        } BIT;
    } MHITD;
};

