talhahisham92/lowleveldriverdevelopment/RX63T_GPT_driver/RX63T_GPT_driver/iodefine.h
struct st_mtu4 {
    char           wk0[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char CCLR:3;
            unsigned char CKEG:2;
            unsigned char TPSC:3;
        } BIT;
    } TCR;
    char           wk1[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char BFB:1;
            unsigned char BFA:1;
            unsigned char MD:4;
        } BIT;
    } TMDR1;
    char           wk2[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IOB:4;
            unsigned char IOA:4;
        } BIT;
    } TIORH;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IOD:4;
            unsigned char IOC:4;
        } BIT;
    } TIORL;
    char           wk3[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char TTGE:1;
            unsigned char TTGE2:1;
            unsigned char :1;
            unsigned char TCIEV:1;
            unsigned char TGIED:1;
            unsigned char TGIEC:1;
            unsigned char TGIEB:1;
            unsigned char TGIEA:1;
        } BIT;
    } TIER;
    char           wk4[8];
    unsigned short TCNT;
    char           wk5[8];
    unsigned short TGRA;
    unsigned short TGRB;
    char           wk6[8];
    unsigned short TGRC;
    unsigned short TGRD;
    char           wk7[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char TCFD:1;
            unsigned char :2;
            unsigned char TCFV:1;
            unsigned char TGFD:1;
            unsigned char TGFC:1;
            unsigned char TGFB:1;
            unsigned char TGFA:1;
        } BIT;
    } TSR;
    char           wk8[11];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char TTSB:1;
            unsigned char TTSA:1;
        } BIT;
    } TBTM;
    char           wk9[6];
    union {
        unsigned short WORD;
        struct {
            unsigned short BF:2;
            unsigned short :6;
            unsigned short UT4AE:1;
            unsigned short DT4AE:1;
            unsigned short UT4BE:1;
            unsigned short DT4BE:1;
            unsigned short ITA3AE:1;
            unsigned short ITA4VE:1;
            unsigned short ITB3AE:1;
            unsigned short ITB4VE:1;
        } BIT;
    } TADCR;
    char           wk10[2];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
    char           wk11[40];
    unsigned short TGRE;
    unsigned short TGRF;
};

struct st_mtu5 {
    unsigned short TCNTU;
    unsigned short TGRU;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char TPSC:2;
        } BIT;
    } TCRU;
    char           wk0[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char IOC:5;
        } BIT;
    } TIORU;
    char           wk1[9];
    unsigned short TCNTV;
    unsigned short TGRV;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char TPSC:2;
        } BIT;
    } TCRV;
    char           wk2[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char IOC:5;
        } BIT;
    } TIORV;
    char           wk3[9];
    unsigned short TCNTW;
    unsigned short TGRW;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char TPSC:2;
        } BIT;
    } TCRW;
    char           wk4[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char IOC:5;
        } BIT;
    } TIORW;
    char           wk5[9];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char CMFU5:1;
            unsigned char CMFV5:1;
            unsigned char CMFW5:1;
        } BIT;
    } TSR;
    char           wk6[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char TGIE5U:1;
            unsigned char TGIE5V:1;
            unsigned char TGIE5W:1;
        } BIT;
    } TIER;
    char           wk7[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char CSTU5:1;
            unsigned char CSTV5:1;
            unsigned char CSTW5:1;
        } BIT;
    } TSTR;
    char           wk8[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char CMPCLR5U:1;
            unsigned char CMPCLR5V:1;
            unsigned char CMPCLR5W:1;
        } BIT;
    } TCNTCMPCLR;
};

struct st_mtu7 {
    char           wk0[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char CCLR:3;
            unsigned char CKEG:2;
            unsigned char TPSC:3;
        } BIT;
    } TCR;
    char           wk1[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char BFB:1;
            unsigned char BFA:1;
            unsigned char MD:4;
        } BIT;
    } TMDR1;
    char           wk2[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IOB:4;
            unsigned char IOA:4;
        } BIT;
    } TIORH;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IOD:4;
            unsigned char IOC:4;
        } BIT;
    } TIORL;
    char           wk3[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char TTGE:1;
            unsigned char TTGE2:1;
            unsigned char :1;
            unsigned char TCIEV:1;
            unsigned char TGIED:1;
            unsigned char TGIEC:1;
            unsigned char TGIEB:1;
            unsigned char TGIEA:1;
        } BIT;
    } TIER;
    char           wk4[8];
    unsigned short TCNT;
    char           wk5[8];
    unsigned short TGRA;
    unsigned short TGRB;
    char           wk6[8];
    unsigned short TGRC;
    unsigned short TGRD;
    char           wk7[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char TCFD:1;
            unsigned char :2;
            unsigned char TCFV:1;
            unsigned char TGFD:1;
            unsigned char TGFC:1;
            unsigned char TGFB:1;
            unsigned char TGFA:1;
        } BIT;
    } TSR;
    char           wk8[11];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char TTSB:1;
            unsigned char TTSA:1;
        } BIT;
    } TBTM;
    char           wk9[6];
    union {
        unsigned short WORD;
        struct {
            unsigned short BF:2;
            unsigned short :6;
            unsigned short UT7AE:1;
            unsigned short DT7AE:1;
            unsigned short UT7BE:1;
            unsigned short DT7BE:1;
            unsigned short ITA6AE:1;
            unsigned short ITA7VE:1;
            unsigned short ITB6AE:1;
            unsigned short ITB7VE:1;
        } BIT;
    } TADCR;
    char           wk10[2];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
    char           wk11[40];
    unsigned short TGRE;
    unsigned short TGRF;
};

struct st_poe {
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :3;
            unsigned char POE0F:1;
            unsigned char :3;
            unsigned char PIE1:1;
            unsigned char :6;
            unsigned char POE0M:2;
        } BIT;
    } ICSR1;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char OSF1:1;
            unsigned char :5;
            unsigned char OCE1:1;
            unsigned char OIE1:1;
        } BIT;
    } OCSR1;
    char           wk0[4];
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :3;
            unsigned char POE8F:1;
            unsigned char :2;
            unsigned char POE8E:1;
            unsigned char PIE3:1;
            unsigned char :6;
            unsigned char POE8M:2;
        } BIT;
    } ICSR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char GPT23HIZ:1;
            unsigned char GPT01HIZ:1;
            unsigned char MTUCH0HIZ:1;
            unsigned char :1;
            unsigned char MTUCH34HIZ:1;
        } BIT;
    } SPOER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char MTU0DZE:1;
            unsigned char MTU0CZE:1;
            unsigned char MTU0BZE:1;
            unsigned char MTU0AZE:1;
        } BIT;
    } POECR1;
    union {
        unsigned short WORD;
        struct {
            unsigned short :5;
            unsigned short MTU3BDZE:1;
            unsigned short MTU4ACZE:1;
            unsigned short MTU4BDZE:1;
        } BIT;
    } POECR2;
    union {
        unsigned short WORD;
        struct {
            unsigned short :6;
            unsigned short GPT3ABZE:1;
            unsigned short GPT2ABZE:1;
            unsigned short :6;
            unsigned short GPT1ABZE:1;
            unsigned short GPT0ABZE:1;
        } BIT;
    } POECR3;
    union {
        unsigned short WORD;
        struct {
            unsigned short :10;
            unsigned short IC5ADDMT34ZE:1;
            unsigned short IC4ADDMT34ZE:1;
            unsigned short IC3ADDMT34ZE:1;
            unsigned short :2;
            unsigned short CMADDMT34ZE:1;
        } BIT;
    } POECR4;
    union {
        unsigned short WORD;
        struct {
            unsigned short :10;
            unsigned short IC5ADDMT0ZE:1;
            unsigned short IC4ADDMT0ZE:1;
            unsigned short :2;
            unsigned short IC1ADDMT0ZE:1;
            unsigned short CMADDMT0ZE:1;
        } BIT;
    } POECR5;
    union {
        unsigned short WORD;
        struct {
            unsigned short :3;
            unsigned short IC4ADDGPT23ZE:1;
            unsigned short IC3ADDGPT23ZE:1;
            unsigned short :1;
            unsigned short IC1ADDGPT23ZE:1;
            unsigned short CMADDGPT23ZE:1;
            unsigned short :2;
            unsigned short IC5ADDGPT01ZE:1;
            unsigned short :1;
            unsigned short IC3ADDGPT01ZE:1;
            unsigned short :1;
            unsigned short IC1ADDGPT01ZE:1;
            unsigned short CMADDGPT01ZE:1;
        } BIT;
    } POECR6;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :3;
            unsigned char POE10F:1;
            unsigned char :2;
            unsigned char POE10E:1;
            unsigned char PIE4:1;
            unsigned char :6;
            unsigned char POE10M:2;
        } BIT;
    } ICSR4;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :3;
            unsigned char POE11F:1;
            unsigned char :2;
            unsigned char POE11E:1;
            unsigned char PIE5:1;
            unsigned char :6;
            unsigned char POE11M:2;
        } BIT;
    } ICSR5;
    union {
        unsigned short WORD;
        struct {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct {
            unsigned char :7;
            unsigned char MTUCHSEL:1;
            unsigned char OLSEN:1;
            unsigned char :1;
            unsigned char OLSG2B:1;
            unsigned char OLSG2A:1;
            unsigned char OLSG1B:1;
            unsigned char OLSG1A:1;
            unsigned char OLSG0B:1;
            unsigned char OLSG0A:1;
        } BIT;
    } ALR1;
    union {
        unsigned short WORD;
        struct {
            unsigned short :3;
            unsigned short OSTSTF:1;
            unsigned short :2;
            unsigned short OSTSTE:1;
        } BIT;
    } ICSR6;
};

struct st_port0 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
};

