talhahisham92/lowleveldriverdevelopment/RX63T_GPT_driver/RX63T_GPT_driver/iodefine.h
struct st_sci0 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CM:1;
            unsigned char CHR:1;
            unsigned char PE:1;
            unsigned char PM:1;
            unsigned char STOP:1;
            unsigned char MP:1;
            unsigned char CKS:2;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TIE:1;
            unsigned char RIE:1;
            unsigned char TE:1;
            unsigned char RE:1;
            unsigned char MPIE:1;
            unsigned char TEIE:1;
            unsigned char CKE:2;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char ORER:1;
            unsigned char FER:1;
            unsigned char PER:1;
            unsigned char TEND:1;
            unsigned char MPB:1;
            unsigned char MPBT:1;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BCP2:1;
            unsigned char :3;
            unsigned char SDIR:1;
            unsigned char SINV:1;
            unsigned char :1;
            unsigned char SMIF:1;
        } BIT;
    } SCMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char NFEN:1;
            unsigned char ABCS:1;
        } BIT;
    } SEMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char NFCS:3;
        } BIT;
    } SNFR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICDL:5;
            unsigned char :2;
            unsigned char IICM:1;
        } BIT;
    } SIMR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char IICACKT:1;
            unsigned char :3;
            unsigned char IICCSC:1;
            unsigned char IICINTM:1;
        } BIT;
    } SIMR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICSCLS:2;
            unsigned char IICSDAS:2;
            unsigned char IICSTIF:1;
            unsigned char IICSTPREQ:1;
            unsigned char IICRSTAREQ:1;
            unsigned char IICSTAREQ:1;
        } BIT;
    } SIMR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IICACKR:1;
        } BIT;
    } SISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKPH:1;
            unsigned char CKPOL:1;
            unsigned char :1;
            unsigned char MFF:1;
            unsigned char :1;
            unsigned char MSS:1;
            unsigned char CTSE:1;
            unsigned char SSE:1;
        } BIT;
    } SPMR;
};

struct st_sci12 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CM:1;
            unsigned char CHR:1;
            unsigned char PE:1;
            unsigned char PM:1;
            unsigned char STOP:1;
            unsigned char MP:1;
            unsigned char CKS:2;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TIE:1;
            unsigned char RIE:1;
            unsigned char TE:1;
            unsigned char RE:1;
            unsigned char MPIE:1;
            unsigned char TEIE:1;
            unsigned char CKE:2;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char ORER:1;
            unsigned char FER:1;
            unsigned char PER:1;
            unsigned char TEND:1;
            unsigned char MPB:1;
            unsigned char MPBT:1;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BCP2:1;
            unsigned char :3;
            unsigned char SDIR:1;
            unsigned char SINV:1;
            unsigned char :1;
            unsigned char SMIF:1;
        } BIT;
    } SCMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char NFEN:1;
            unsigned char ABCS:1;
            unsigned char :3;
            unsigned char ACS0:1;
        } BIT;
    } SEMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char NFCS:3;
        } BIT;
    } SNFR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICDL:5;
            unsigned char :2;
            unsigned char IICM:1;
        } BIT;
    } SIMR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char IICACKT:1;
            unsigned char :3;
            unsigned char IICCSC:1;
            unsigned char IICINTM:1;
        } BIT;
    } SIMR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICSCLS:2;
            unsigned char IICSDAS:2;
            unsigned char IICSTIF:1;
            unsigned char IICSTPREQ:1;
            unsigned char IICRSTAREQ:1;
            unsigned char IICSTAREQ:1;
        } BIT;
    } SIMR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IICACKR:1;
        } BIT;
    } SISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKPH:1;
            unsigned char CKPOL:1;
            unsigned char :1;
            unsigned char MFF:1;
            unsigned char :1;
            unsigned char MSS:1;
            unsigned char CTSE:1;
            unsigned char SSE:1;
        } BIT;
    } SPMR;
    char           wk0[18];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ESME:1;
        } BIT;
    } ESMER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char BRME:1;
            unsigned char RXDSF:1;
            unsigned char SFSF:1;
        } BIT;
    } CR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char PIBS:3;
            unsigned char PIBE:1;
            unsigned char CF1DS:2;
            unsigned char CF0RE:1;
            unsigned char BFE:1;
        } BIT;
    } CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RTS:2;
            unsigned char BCCS:2;
            unsigned char :1;
            unsigned char DFCS:3;
        } BIT;
    } CR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SDST:1;
        } BIT;
    } CR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char SHARPS:1;
            unsigned char :2;
            unsigned char RXDXPS:1;
            unsigned char TXDXPS:1;
        } BIT;
    } PCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char AEDIE:1;
            unsigned char BCDIE:1;
            unsigned char PIBDIE:1;
            unsigned char CF1MIE:1;
            unsigned char CF0MIE:1;
            unsigned char BFDIE:1;
        } BIT;
    } ICR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char AEDF:1;
            unsigned char BCDF:1;
            unsigned char PIBDF:1;
            unsigned char CF1MF:1;
            unsigned char CF0MF:1;
            unsigned char BFDF:1;
        } BIT;
    } STR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char AEDCL:1;
            unsigned char BCDCL:1;
            unsigned char PIBDCL:1;
            unsigned char CF1MCL:1;
            unsigned char CF0MCL:1;
            unsigned char BFDCL:1;
        } BIT;
    } STCR;
    unsigned char  CF0DR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CF0CE7:1;
            unsigned char CF0CE6:1;
            unsigned char CF0CE5:1;
            unsigned char CF0CE4:1;
            unsigned char CF0CE3:1;
            unsigned char CF0CE2:1;
            unsigned char CF0CE1:1;
            unsigned char CF0CE0:1;
        } BIT;
    } CF0CR;
    unsigned char  CF0RR;
    unsigned char  PCF1DR;
    unsigned char  SCF1DR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CF1CE7:1;
            unsigned char CF1CE6:1;
            unsigned char CF1CE5:1;
            unsigned char CF1CE4:1;
            unsigned char CF1CE3:1;
            unsigned char CF1CE2:1;
            unsigned char CF1CE1:1;
            unsigned char CF1CE0:1;
        } BIT;
    } CF1CR;
    unsigned char  CF1RR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char TCST:1;
        } BIT;
    } TCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char TCSS:3;
            unsigned char TWRC:1;
            unsigned char :1;
            unsigned char TOMS:2;
        } BIT;
    } TMR;
    unsigned char  TPRE;
    unsigned char  TCNT;
};

struct st_smci0 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char GM:1;
            unsigned char BLK:1;
            unsigned char PE:1;
            unsigned char PM:1;
            unsigned char BCP:2;
            unsigned char CKS:2;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TIE:1;
            unsigned char RIE:1;
            unsigned char TE:1;
            unsigned char RE:1;
            unsigned char MPIE:1;
            unsigned char TEIE:1;
            unsigned char CKE:2;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char ORER:1;
            unsigned char ERS:1;
            unsigned char PER:1;
            unsigned char TEND:1;
            unsigned char MPB:1;
            unsigned char MPBT:1;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BCP2:1;
            unsigned char :3;
            unsigned char SDIR:1;
            unsigned char SINV:1;
            unsigned char :1;
            unsigned char SMIF:1;
        } BIT;
    } SCMR;
};

struct st_smci12 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char GM:1;
            unsigned char BCLK:1;
            unsigned char PE:1;
            unsigned char PM:1;
            unsigned char BCP:2;
            unsigned char CKS:2;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TIE:1;
            unsigned char RIE:1;
            unsigned char TE:1;
            unsigned char RE:1;
            unsigned char MPIE:1;
            unsigned char TEIE:1;
            unsigned char CKE:2;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char ORER:1;
            unsigned char ERS:1;
            unsigned char PER:1;
            unsigned char TEND:1;
            unsigned char MPB:1;
            unsigned char MPBT:1;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BCP2:1;
            unsigned char :3;
            unsigned char SDIR:1;
            unsigned char SINV:1;
            unsigned char :1;
            unsigned char SMIF:1;
        } BIT;
    } SCMR;
};

struct st_system {
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short MD:1;
        } BIT;
    } MDMONR;
    char           wk0[4];
    union {
        unsigned short WORD;
        struct {
            unsigned short KEY:8;
            unsigned short :7;
            unsigned short ROME:1;
        } BIT;
    } SYSCR0;
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short RAME:1;
        } BIT;
    } SYSCR1;
    char           wk1[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short SSBY:1;
        } BIT;
    } SBYCR;
    char           wk2[2];
    union {
        unsigned long LONG;
        struct {
            unsigned long ACSE:1;
            unsigned long :1;
            unsigned long MSTPA29:1;
            unsigned long MSTPA28:1;
            unsigned long MSTPA27:1;
            unsigned long :2;
            unsigned long MSTPA24:1;
            unsigned long :6;
            unsigned long MSTPA17:1;
            unsigned long :1;
            unsigned long MSTPA15:1;
            unsigned long MSTPA14:1;
            unsigned long :4;
            unsigned long MSTPA9:1;
            unsigned long :1;
            unsigned long MSTPA7:1;
        } BIT;
    } MSTPCRA;
    union {
        unsigned long LONG;
        struct {
            unsigned long MSTPB31:1;
            unsigned long MSTPB30:1;
            unsigned long :6;
            unsigned long MSTPB23:1;
            unsigned long :1;
            unsigned long MSTPB21:1;
            unsigned long :3;
            unsigned long MSTPB17:1;
            unsigned long :10;
            unsigned long MSTPB6:1;
            unsigned long :1;
            unsigned long MSTPB4:1;
        } BIT;
    } MSTPCRB;
    union {
        unsigned long LONG;
        struct {
            unsigned long :12;
            unsigned long MSTPC19:1;
            unsigned long :18;
            unsigned long MSTPC0:1;
        } BIT;
    } MSTPCRC;
    char           wk3[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long FCK:4;
            unsigned long ICK:4;
            unsigned long :8;
            unsigned long PCKA:4;
            unsigned long PCKB:4;
            unsigned long :4;
            unsigned long PCKD:4;
        } BIT;
    } SCKCR;
    char           wk4[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short :5;
            unsigned short CKSEL:3;
        } BIT;
    } SCKCR3;
    union {
        unsigned short WORD;
        struct {
            unsigned short :2;
            unsigned short STC:6;
            unsigned short :6;
            unsigned short PLIDIV:2;
        } BIT;
    } PLLCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char PLLEN:1;
        } BIT;
    } PLLCR2;
    char           wk5[7];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char MOSTP:1;
        } BIT;
    } MOSCCR;
    char           wk6[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char LCSTP:1;
        } BIT;
    } LOCOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ILCSTP:1;
        } BIT;
    } ILOCOCR;
    char           wk7[10];
    union {
        unsigned char BYTE;
        struct {
            unsigned char OSTDE:1;
            unsigned char :6;
            unsigned char OSTDIE:1;
        } BIT;
    } OSTDCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char OSTDF:1;
        } BIT;
    } OSTDSR;
    char           wk8[96];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char MSTS:5;
        } BIT;
    } MOSCWTCR;
    char           wk9[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSTS:5;
        } BIT;
    } PLLWTCR;
    char           wk10[25];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char SWRF:1;
            unsigned char WDTRF:1;
            unsigned char IWDTRF:1;
        } BIT;
    } RSTSR2;
    char           wk11[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short SWRR:16;
        } BIT;
    } SWRR;
    char           wk12[28];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD1IDTSEL:2;
        } BIT;
    } LVD1CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD1MON:1;
            unsigned char LVD1DET:1;
        } BIT;
    } LVD1SR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD2IDTSEL:2;
        } BIT;
    } LVD2CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD2MON:1;
            unsigned char LVD2DET:1;
        } BIT;
    } LVD2SR;
    char           wk13[794];
    union {
        unsigned short WORD;
        struct {
            unsigned short PRKEY:8;
            unsigned short :4;
            unsigned short PRC3:1;
            unsigned short :1;
            unsigned short PRC1:1;
            unsigned short PRC0:1;
        } BIT;
    } PRCR;
    char           wk14[48768];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DPSBY:1;
            unsigned char IOKEEP:1;
        } BIT;
    } DPSBYCR;
    char           wk15[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char DIRQ5E:1;
            unsigned char DIRQ4E:1;
            unsigned char DIRQ3E:1;
            unsigned char DIRQ2E:1;
            unsigned char DIRQ1E:1;
            unsigned char DIRQ0E:1;
        } BIT;
    } DPSIER0;
    char           wk16[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char DNMIE:1;
            unsigned char :2;
            unsigned char DLVD2IE:1;
            unsigned char DLVD1IE:1;
        } BIT;
    } DPSIER2;
    char           wk17[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char DIRQ5F:1;
            unsigned char DIRQ4F:1;
            unsigned char DIRQ3F:1;
            unsigned char DIRQ2F:1;
            unsigned char DIRQ1F:1;
            unsigned char DIRQ0F:1;
        } BIT;
    } DPSIFR0;
    char           wk18[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char DNMIF:1;
            unsigned char :2;
            unsigned char DLVD2IF:1;
            unsigned char DLVD1IF:1;
        } BIT;
    } DPSIFR2;
    char           wk19[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char DIRQ5EG:1;
            unsigned char DIRQ4EG:1;
            unsigned char DIRQ3EG:1;
            unsigned char DIRQ2EG:1;
            unsigned char DIRQ1EG:1;
            unsigned char DIRQ0EG:1;
        } BIT;
    } DPSIEGR0;
    char           wk20[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char DNMIEG:1;
            unsigned char :2;
            unsigned char DLVD2EG:1;
            unsigned char DLVD1EG:1;
        } BIT;
    } DPSIEGR2;
    char           wk21[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DPSRSTF:1;
            unsigned char :3;
            unsigned char LVD2RF:1;
            unsigned char LVD1RF:1;
            unsigned char LVD0RF:1;
            unsigned char PORF:1;
        } BIT;
    } RSTSR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char CWSF:1;
        } BIT;
    } RSTSR1;
    char           wk22[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char MOFXIN:1;
        } BIT;
    } MOFCR;
    char           wk23[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char LVD2E:1;
            unsigned char LVD1E:1;
        } BIT;
    } LVCMPCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2LVL:4;
            unsigned char LVD1LVL:4;
        } BIT;
    } LVDLVLR;
    char           wk24[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1RN:1;
            unsigned char LVD1RI:1;
            unsigned char LVD1FSAMP:2;
            unsigned char :1;
            unsigned char LVD1CMPE:1;
            unsigned char LVD1DFDIS:1;
            unsigned char LVD1RIE:1;
        } BIT;
    } LVD1CR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2RN:1;
            unsigned char LVD2RI:1;
            unsigned char LVD2FSAMP:2;
            unsigned char :1;
            unsigned char LVD2CMPE:1;
            unsigned char LVD2DFDIS:1;
            unsigned char LVD2RIE:1;
        } BIT;
    } LVD2CR0;
    char           wk25[4];
    unsigned char  DPSBKR[32];
};

struct st_wdt {
    unsigned char  WDTRR;
    char           wk0[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :2;
            unsigned short RPSS:2;
            unsigned short :2;
            unsigned short RPES:2;
            unsigned short CKS:4;
            unsigned short :2;
            unsigned short TOPS:2;
        } BIT;
    } WDTCR;
    union {
        unsigned short WORD;
        struct {
            unsigned short REFEF:1;
            unsigned short UNDFF:1;
            unsigned short CNTVAL:14;
        } BIT;
    } WDTSR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RSTIRQS:1;
        } BIT;
    } WDTRCR;
};

