talhahisham92/lowleveldriverdevelopment/RX63T_GPT_driver/RX63T_GPT_driver/iodefine.h
enum enum_ir {
IR_BSC_BUSERR=16,IR_FCU_FIFERR=21,IR_FCU_FRDYI=23,
IR_ICU_SWINT=27,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CMT2_CMI2,
IR_CMT3_CMI3,
IR_CAC_FERRF=36,IR_CAC_MENDF,IR_CAC_OVFF,
IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,IR_RSPI0_SPII0,
IR_DOC_DOPCF=57,
IR_ICU_IRQ0=64,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,
IR_S12AD_S12ADI=102,IR_S12AD_S12GBADI,
IR_ICU_GROUP12=114,
IR_SCI12_SCIX0=122,IR_SCI12_SCIX1,IR_SCI12_SCIX2,IR_SCI12_SCIX3,
IR_MTU0_TGIA0,IR_MTU0_TGIB0,IR_MTU0_TGIC0,IR_MTU0_TGID0,IR_MTU0_TCIV0,IR_MTU0_TGIE0,IR_MTU0_TGIF0,
IR_MTU1_TGIA1,IR_MTU1_TGIB1,IR_MTU1_TCIV1,IR_MTU1_TCIU1,
IR_MTU2_TGIA2,IR_MTU2_TGIB2,IR_MTU2_TCIV2,IR_MTU2_TCIU2,
IR_MTU3_TGIA3,IR_MTU3_TGIB3,IR_MTU3_TGIC3,IR_MTU3_TGID3,IR_MTU3_TCIV3,
IR_MTU4_TGIA4,IR_MTU4_TGIB4,IR_MTU4_TGIC4,IR_MTU4_TGID4,IR_MTU4_TCIV4,
IR_MTU5_TGIU5,IR_MTU5_TGIV5,IR_MTU5_TGIW5,
IR_MTU6_TGIA6,IR_MTU6_TGIB6,IR_MTU6_TGIC6,IR_MTU6_TGID6,IR_MTU6_TCIV6,
IR_MTU7_TGIA7=161,IR_MTU7_TGIB7,IR_MTU7_TGIC7,IR_MTU7_TGID7,IR_MTU7_TCIV7,
IR_POE_OEI1,IR_POE_OEI3=168,IR_POE_OEI4,
IR_CMP_CMP0=171,IR_CMP_CMP1,IR_CMP_CMP2,
IR_RIIC0_EEI0=194,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0,
IR_DMAC_DMAC0I,IR_DMAC_DMAC1I,IR_DMAC_DMAC2I,IR_DMAC_DMAC3I,
IR_SCI0_RXI0=214,IR_SCI0_TXI0,IR_SCI0_TEI0,
IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_GPT0_GTCIA0=226,IR_GPT0_GTCIB0,IR_GPT0_GTCIC0,IR_GPT0_GTCIE0,IR_GPT0_GTCIV0,IR_GPT0_LOCOI,
IR_GPT1_GTCIA1,IR_GPT1_GTCIB1,IR_GPT1_GTCIC1,IR_GPT1_GTCIE1,IR_GPT1_GTCIV1,
IR_GPT2_GTCIA2=238,IR_GPT2_GTCIB2,IR_GPT2_GTCIC2,IR_GPT2_GTCIE2,IR_GPT2_GTCIV2,
IR_GPT3_GTCIA3=244,IR_GPT3_GTCIB3,IR_GPT3_GTCIC3,IR_GPT3_GTCIE3,IR_GPT3_GTCIV3,
IR_SCI12_RXI12=250,IR_SCI12_TXI12,IR_SCI12_TEI12
};

enum enum_dtce {
DTCE_ICU_SWINT=27,
DTCE_CMT0_CMI0,
DTCE_CMT1_CMI1,
DTCE_CMT2_CMI2,
DTCE_CMT3_CMI3,
DTCE_RSPI0_SPRI0=39,DTCE_RSPI0_SPTI0,
DTCE_ICU_IRQ0=64,DTCE_ICU_IRQ1,DTCE_ICU_IRQ2,DTCE_ICU_IRQ3,DTCE_ICU_IRQ4,DTCE_ICU_IRQ5,
DTCE_S12AD_S12ADI=102,DTCE_S12AD_S12GBADI,
DTCE_MTU0_TGIA0=126,DTCE_MTU0_TGIB0,DTCE_MTU0_TGIC0,DTCE_MTU0_TGID0,
DTCE_MTU1_TGIA1=133,DTCE_MTU1_TGIB1,
DTCE_MTU2_TGIA2=137,DTCE_MTU2_TGIB2,
DTCE_MTU3_TGIA3=141,DTCE_MTU3_TGIB3,DTCE_MTU3_TGIC3,DTCE_MTU3_TGID3,
DTCE_MTU4_TGIA4=146,DTCE_MTU4_TGIB4,DTCE_MTU4_TGIC4,DTCE_MTU4_TGID4,DTCE_MTU4_TCIV4,
DTCE_MTU5_TGIU5,DTCE_MTU5_TGIV5,DTCE_MTU5_TGIW5,
DTCE_MTU6_TGIA6,DTCE_MTU6_TGIB6,DTCE_MTU6_TGIC6,DTCE_MTU6_TGID6,
DTCE_MTU7_TGIA7=161,DTCE_MTU7_TGIB7,DTCE_MTU7_TGIC7,DTCE_MTU7_TGID7,DTCE_MTU7_TCIV7,
DTCE_CMP_CMP0=171,DTCE_CMP_CMP1,DTCE_CMP_CMP2,
DTCE_RIIC0_RXI0=195,DTCE_RIIC0_TXI0,
DTCE_DMAC_DMAC0I=198,DTCE_DMAC_DMAC1I,DTCE_DMAC_DMAC2I,DTCE_DMAC_DMAC3I,
DTCE_SCI0_RXI0=214,DTCE_SCI0_TXI0,
DTCE_SCI1_RXI1=217,DTCE_SCI1_TXI1,
DTCE_GPT0_GTCIA0=226,DTCE_GPT0_GTCIB0,DTCE_GPT0_GTCIC0,DTCE_GPT0_GTCIE0,DTCE_GPT0_GTCIV0,DTCE_GPT0_LOCOI,
DTCE_GPT1_GTCIA1,DTCE_GPT1_GTCIB1,DTCE_GPT1_GTCIC1,DTCE_GPT1_GTCIE1,DTCE_GPT1_GTCIV1,
DTCE_GPT2_GTCIA2=238,DTCE_GPT2_GTCIB2,DTCE_GPT2_GTCIC2,DTCE_GPT2_GTCIE2,DTCE_GPT2_GTCIV2,
DTCE_GPT3_GTCIA3=244,DTCE_GPT3_GTCIB3,DTCE_GPT3_GTCIC3,DTCE_GPT3_GTCIE3,DTCE_GPT3_GTCIV3,
DTCE_SCI12_RXI12=250,DTCE_SCI12_TXI12
};

enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_FCU_FIFERR=0x02,IER_FCU_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,
IER_CMT3_CMI3=0x03,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_RSPI0_SPRI0=0x04,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_DOC_DOPCF=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,
IER_S12AD_S12ADI=0x0C,IER_S12AD_S12GBADI=0x0C,
IER_ICU_GROUP12=0x0E,
IER_SCI12_SCIX0=0x0F,IER_SCI12_SCIX1=0x0F,IER_SCI12_SCIX2=0x0F,IER_SCI12_SCIX3=0x0F,
IER_MTU0_TGIA0=0x0F,IER_MTU0_TGIB0=0x0F,IER_MTU0_TGIC0=0x10,IER_MTU0_TGID0=0x10,IER_MTU0_TCIV0=0x10,IER_MTU0_TGIE0=0x10,IER_MTU0_TGIF0=0x10,
IER_MTU1_TGIA1=0x10,IER_MTU1_TGIB1=0x10,IER_MTU1_TCIV1=0x10,IER_MTU1_TCIU1=0x11,
IER_MTU2_TGIA2=0x11,IER_MTU2_TGIB2=0x11,IER_MTU2_TCIV2=0x11,IER_MTU2_TCIU2=0x11,
IER_MTU3_TGIA3=0x11,IER_MTU3_TGIB3=0x11,IER_MTU3_TGIC3=0x11,IER_MTU3_TGID3=0x12,IER_MTU3_TCIV3=0x12,
IER_MTU4_TGIA4=0x12,IER_MTU4_TGIB4=0x12,IER_MTU4_TGIC4=0x12,IER_MTU4_TGID4=0x12,IER_MTU4_TCIV4=0x12,
IER_MTU5_TGIU5=0x12,IER_MTU5_TGIV5=0x13,IER_MTU5_TGIW5=0x13,
IER_MTU6_TGIA6=0x13,IER_MTU6_TGIB6=0x13,IER_MTU6_TGIC6=0x13,IER_MTU6_TGID6=0x13,IER_MTU6_TCIV6=0x13,
IER_MTU7_TGIA7=0x14,IER_MTU7_TGIB7=0x14,IER_MTU7_TGIC7=0x14,IER_MTU7_TGID7=0x14,IER_MTU7_TCIV7=0x14,
IER_POE_OEI1=0x14,IER_POE_OEI3=0x15,IER_POE_OEI4=0x15,
IER_CMP_CMP0=0x15,IER_CMP_CMP1=0x15,IER_CMP_CMP2=0x15,
IER_RIIC0_EEI0=0x18,IER_RIIC0_RXI0=0x18,IER_RIIC0_TXI0=0x18,IER_RIIC0_TEI0=0x18,
IER_DMAC_DMAC0I=0x18,IER_DMAC_DMAC1I=0x18,IER_DMAC_DMAC2I=0x19,IER_DMAC_DMAC3I=0x19,
IER_SCI0_RXI0=0x1A,IER_SCI0_TXI0=0x1A,IER_SCI0_TEI0=0x1B,
IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_GPT0_GTCIA0=0x1C,IER_GPT0_GTCIB0=0x1C,IER_GPT0_GTCIC0=0x1C,IER_GPT0_GTCIE0=0x1C,IER_GPT0_GTCIV0=0x1C,IER_GPT0_LOCOI=0x1C,
IER_GPT1_GTCIA1=0x1D,IER_GPT1_GTCIB1=0x1D,IER_GPT1_GTCIC1=0x1D,IER_GPT1_GTCIE1=0x1D,IER_GPT1_GTCIV1=0x1D,
IER_GPT2_GTCIA2=0x1D,IER_GPT2_GTCIB2=0x1D,IER_GPT2_GTCIC2=0x1E,IER_GPT2_GTCIE2=0x1E,IER_GPT2_GTCIV2=0x1E,
IER_GPT3_GTCIA3=0x1E,IER_GPT3_GTCIB3=0x1E,IER_GPT3_GTCIC3=0x1E,IER_GPT3_GTCIE3=0x1E,IER_GPT3_GTCIV3=0x1F,
IER_SCI12_RXI12=0x1F,IER_SCI12_TXI12=0x1F,IER_SCI12_TEI12=0x1F
};

enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_FCU_FIFERR=1,IPR_FCU_FRDYI=2,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CMT2_CMI2=6,
IPR_CMT3_CMI3=7,
IPR_CAC_FERRF=36,IPR_CAC_MENDF=36,IPR_CAC_OVFF=36,
IPR_RSPI0_SPRI0=39,IPR_RSPI0_SPTI0=40,IPR_RSPI0_SPII0=41,
IPR_DOC_DOPCF=57,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,
IPR_S12AD_S12ADI=102,IPR_S12AD_S12GBADI=103,
IPR_ICU_GROUP12=114,
IPR_SCI12_SCIX0=122,IPR_SCI12_SCIX1=122,IPR_SCI12_SCIX2=122,IPR_SCI12_SCIX3=122,
IPR_MTU0_TGIA0=126,IPR_MTU0_TGIB0=126,IPR_MTU0_TGIC0=126,IPR_MTU0_TGID0=126,IPR_MTU0_TCIV0=130,IPR_MTU0_TGIE0=130,IPR_MTU0_TGIF0=130,
IPR_MTU1_TGIA1=133,IPR_MTU1_TGIB1=133,IPR_MTU1_TCIV1=135,IPR_MTU1_TCIU1=135,
IPR_MTU2_TGIA2=137,IPR_MTU2_TGIB2=137,IPR_MTU2_TCIV2=139,IPR_MTU2_TCIU2=139,
IPR_MTU3_TGIA3=141,IPR_MTU3_TGIB3=141,IPR_MTU3_TGIC3=141,IPR_MTU3_TGID3=141,IPR_MTU3_TCIV3=145,
IPR_MTU4_TGIA4=146,IPR_MTU4_TGIB4=146,IPR_MTU4_TGIC4=146,IPR_MTU4_TGID4=146,IPR_MTU4_TCIV4=150,
IPR_MTU5_TGIU5=151,IPR_MTU5_TGIV5=151,IPR_MTU5_TGIW5=151,
IPR_MTU6_TGIA6=154,IPR_MTU6_TGIB6=154,IPR_MTU6_TGIC6=154,IPR_MTU6_TGID6=154,IPR_MTU6_TCIV6=158,
IPR_MTU7_TGIA7=161,IPR_MTU7_TGIB7=161,IPR_MTU7_TGIC7=163,IPR_MTU7_TGID7=163,IPR_MTU7_TCIV7=165,
IPR_POE_OEI1=166,IPR_POE_OEI3=166,IPR_POE_OEI4=166,
IPR_CMP_CMP0=171,IPR_CMP_CMP1=172,IPR_CMP_CMP2=173,
IPR_RIIC0_EEI0=194,IPR_RIIC0_RXI0=194,IPR_RIIC0_TXI0=194,IPR_RIIC0_TEI0=194,
IPR_DMAC_DMAC0I=198,IPR_DMAC_DMAC1I=199,IPR_DMAC_DMAC2I=200,IPR_DMAC_DMAC3I=201,
IPR_SCI0_RXI0=214,IPR_SCI0_TXI0=214,IPR_SCI0_TEI0=214,
IPR_SCI1_RXI1=217,IPR_SCI1_TXI1=217,IPR_SCI1_TEI1=217,
IPR_GPT0_GTCIA0=226,IPR_GPT0_GTCIB0=226,IPR_GPT0_GTCIC0=226,IPR_GPT0_GTCIE0=229,IPR_GPT0_GTCIV0=229,IPR_GPT0_LOCOI=229,
IPR_GPT1_GTCIA1=232,IPR_GPT1_GTCIB1=232,IPR_GPT1_GTCIC1=232,IPR_GPT1_GTCIE1=235,IPR_GPT1_GTCIV1=235,
IPR_GPT2_GTCIA2=238,IPR_GPT2_GTCIB2=238,IPR_GPT2_GTCIC2=238,IPR_GPT2_GTCIE2=241,IPR_GPT2_GTCIV2=241,
IPR_GPT3_GTCIA3=244,IPR_GPT3_GTCIB3=244,IPR_GPT3_GTCIC3=244,IPR_GPT3_GTCIE3=247,IPR_GPT3_GTCIV3=247,
IPR_SCI12_RXI12=250,IPR_SCI12_TXI12=250,IPR_SCI12_TEI12=250,
IPR_BSC_=0,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_CMT2_=6,
IPR_CMT3_=7,
IPR_CAC_=36,
IPR_DOC_=57,
IPR_SCI12_SCIX_=122,
IPR_MTU1_TGI=133,
IPR_MTU1_TCI=135,
IPR_MTU2_TGI=137,
IPR_MTU2_TCI=139,
IPR_MTU3_TGI=141,
IPR_MTU4_TGI=146,
IPR_MTU5_=151,
IPR_MTU5_TGI=151,
IPR_MTU6_TGI=154,
IPR_POE_=166,
IPR_RIIC0_=194,
IPR_SCI0_=214,
IPR_SCI1_=217,
IPR_SCI12_=250,
};

enum enum_grp {
GRP_SCI0_ERI0=12,GRP_SCI1_ERI1=12,GRP_SCI12_ERI12=12,GRP_RSPI0_SPEI0=12
};

enum enum_gen {
GEN_SCI0_ERI0=12,GEN_SCI1_ERI1=12,GEN_SCI12_ERI12=12,GEN_RSPI0_SPEI0=12
};

#define IEN_BSC_BUSERR      IEN0
#define IEN_FCU_FIFERR      IEN5
#define IEN_FCU_FRDYI       IEN7
#define IEN_ICU_SWINT       IEN3
#define IEN_CMT0_CMI0       IEN4
#define IEN_CMT1_CMI1       IEN5
#define IEN_CMT2_CMI2       IEN6
#define IEN_CMT3_CMI3       IEN7
#define IEN_CAC_FERRF       IEN4
#define IEN_CAC_MENDF       IEN5
#define IEN_CAC_OVFF        IEN6
#define IEN_RSPI0_SPRI0     IEN7
#define IEN_RSPI0_SPTI0     IEN0
#define IEN_RSPI0_SPII0     IEN1
#define IEN_DOC_DOPCF       IEN1
#define IEN_ICU_IRQ0        IEN0
#define IEN_ICU_IRQ1        IEN1
#define IEN_ICU_IRQ2        IEN2
#define IEN_ICU_IRQ3        IEN3
#define IEN_ICU_IRQ4        IEN4
#define IEN_ICU_IRQ5        IEN5
#define IEN_S12AD_S12ADI    IEN6
#define IEN_S12AD_S12GBADI  IEN7
#define IEN_ICU_GROUP12     IEN2
#define IEN_SCI12_SCIX0     IEN2
#define IEN_SCI12_SCIX1     IEN3
#define IEN_SCI12_SCIX2     IEN4
#define IEN_SCI12_SCIX3     IEN5
#define IEN_MTU0_TGIA0      IEN6
#define IEN_MTU0_TGIB0      IEN7
#define IEN_MTU0_TGIC0      IEN0
#define IEN_MTU0_TGID0      IEN1
#define IEN_MTU0_TCIV0      IEN2
#define IEN_MTU0_TGIE0      IEN3
#define IEN_MTU0_TGIF0      IEN4
#define IEN_MTU1_TGIA1      IEN5
#define IEN_MTU1_TGIB1      IEN6
#define IEN_MTU1_TCIV1      IEN7
#define IEN_MTU1_TCIU1      IEN0
#define IEN_MTU2_TGIA2      IEN1
#define IEN_MTU2_TGIB2      IEN2
#define IEN_MTU2_TCIV2      IEN3
#define IEN_MTU2_TCIU2      IEN4
#define IEN_MTU3_TGIA3      IEN5
#define IEN_MTU3_TGIB3      IEN6
#define IEN_MTU3_TGIC3      IEN7
#define IEN_MTU3_TGID3      IEN0
#define IEN_MTU3_TCIV3      IEN1
#define IEN_MTU4_TGIA4      IEN2
#define IEN_MTU4_TGIB4      IEN3
#define IEN_MTU4_TGIC4      IEN4
#define IEN_MTU4_TGID4      IEN5
#define IEN_MTU4_TCIV4      IEN6
#define IEN_MTU5_TGIU5      IEN7
#define IEN_MTU5_TGIV5      IEN0
#define IEN_MTU5_TGIW5      IEN1
#define IEN_MTU6_TGIA6      IEN2
#define IEN_MTU6_TGIB6      IEN3
#define IEN_MTU6_TGIC6      IEN4
#define IEN_MTU6_TGID6      IEN5
#define IEN_MTU6_TCIV6      IEN6
#define IEN_MTU7_TGIA7      IEN1
#define IEN_MTU7_TGIB7      IEN2
#define IEN_MTU7_TGIC7      IEN3
#define IEN_MTU7_TGID7      IEN4
#define IEN_MTU7_TCIV7      IEN5
#define IEN_POE_OEI1        IEN6
#define IEN_POE_OEI3        IEN0
#define IEN_POE_OEI4        IEN1
#define IEN_CMP_CMP0        IEN3
#define IEN_CMP_CMP1        IEN4
#define IEN_CMP_CMP2        IEN5
#define IEN_RIIC0_EEI0      IEN2
#define IEN_RIIC0_RXI0      IEN3
#define IEN_RIIC0_TXI0      IEN4
#define IEN_RIIC0_TEI0      IEN5
#define IEN_DMAC_DMAC0I     IEN6
#define IEN_DMAC_DMAC1I     IEN7
#define IEN_DMAC_DMAC2I     IEN0
#define IEN_DMAC_DMAC3I     IEN1
#define IEN_SCI0_RXI0       IEN6
#define IEN_SCI0_TXI0       IEN7
#define IEN_SCI0_TEI0       IEN0
#define IEN_SCI1_RXI1       IEN1
#define IEN_SCI1_TXI1       IEN2
#define IEN_SCI1_TEI1       IEN3
#define IEN_GPT0_GTCIA0     IEN2
#define IEN_GPT0_GTCIB0     IEN3
#define IEN_GPT0_GTCIC0     IEN4
#define IEN_GPT0_GTCIE0     IEN5
#define IEN_GPT0_GTCIV0     IEN6
#define IEN_GPT0_LOCOI      IEN7
#define IEN_GPT1_GTCIA1     IEN0
#define IEN_GPT1_GTCIB1     IEN1
#define IEN_GPT1_GTCIC1     IEN2
#define IEN_GPT1_GTCIE1     IEN3
#define IEN_GPT1_GTCIV1     IEN4
#define IEN_GPT2_GTCIA2     IEN6
#define IEN_GPT2_GTCIB2     IEN7
#define IEN_GPT2_GTCIC2     IEN0
#define IEN_GPT2_GTCIE2     IEN1
#define IEN_GPT2_GTCIV2     IEN2
#define IEN_GPT3_GTCIA3     IEN4
#define IEN_GPT3_GTCIB3     IEN5
#define IEN_GPT3_GTCIC3     IEN6
#define IEN_GPT3_GTCIE3     IEN7
#define IEN_GPT3_GTCIV3     IEN0
#define IEN_SCI12_RXI12     IEN2
#define IEN_SCI12_TXI12     IEN3
#define IEN_SCI12_TEI12     IEN4

#define VECT_BSC_BUSERR     16
#define VECT_FCU_FIFERR     21
#define VECT_FCU_FRDYI      23
#define VECT_ICU_SWINT      27
#define VECT_CMT0_CMI0      28
#define VECT_CMT1_CMI1      29
#define VECT_CMT2_CMI2      30
#define VECT_CMT3_CMI3      31
#define VECT_CAC_FERRF      36
#define VECT_CAC_MENDF      37
#define VECT_CAC_OVFF       38
#define VECT_RSPI0_SPRI0    39
#define VECT_RSPI0_SPTI0    40
#define VECT_RSPI0_SPII0    41
#define VECT_DOC_DOPCF      57
#define VECT_ICU_IRQ0       64
#define VECT_ICU_IRQ1       65
#define VECT_ICU_IRQ2       66
#define VECT_ICU_IRQ3       67
#define VECT_ICU_IRQ4       68
#define VECT_ICU_IRQ5       69
#define VECT_S12AD_S12ADI   102
#define VECT_S12AD_S12GBADI 103
#define VECT_ICU_GROUP12    114
#define VECT_SCI12_SCIX0    122
#define VECT_SCI12_SCIX1    123
#define VECT_SCI12_SCIX2    124
#define VECT_SCI12_SCIX3    125
#define VECT_MTU0_TGIA0     126
#define VECT_MTU0_TGIB0     127
#define VECT_MTU0_TGIC0     128
#define VECT_MTU0_TGID0     129
#define VECT_MTU0_TCIV0     130
#define VECT_MTU0_TGIE0     131
#define VECT_MTU0_TGIF0     132
#define VECT_MTU1_TGIA1     133
#define VECT_MTU1_TGIB1     134
#define VECT_MTU1_TCIV1     135
#define VECT_MTU1_TCIU1     136
#define VECT_MTU2_TGIA2     137
#define VECT_MTU2_TGIB2     138
#define VECT_MTU2_TCIV2     139
#define VECT_MTU2_TCIU2     140
#define VECT_MTU3_TGIA3     141
#define VECT_MTU3_TGIB3     142
#define VECT_MTU3_TGIC3     143
#define VECT_MTU3_TGID3     144
#define VECT_MTU3_TCIV3     145
#define VECT_MTU4_TGIA4     146
#define VECT_MTU4_TGIB4     147
#define VECT_MTU4_TGIC4     148
#define VECT_MTU4_TGID4     149
#define VECT_MTU4_TCIV4     150
#define VECT_MTU5_TGIU5     151
#define VECT_MTU5_TGIV5     152
#define VECT_MTU5_TGIW5     153
#define VECT_MTU6_TGIA6     154
#define VECT_MTU6_TGIB6     155
#define VECT_MTU6_TGIC6     156
#define VECT_MTU6_TGID6     157
#define VECT_MTU6_TCIV6     158
#define VECT_MTU7_TGIA7     161
#define VECT_MTU7_TGIB7     162
#define VECT_MTU7_TGIC7     163
#define VECT_MTU7_TGID7     164
#define VECT_MTU7_TCIV7     165
#define VECT_POE_OEI1       166
#define VECT_POE_OEI3       168
#define VECT_POE_OEI4       169
#define VECT_CMP_CMP0       171
#define VECT_CMP_CMP1       172
#define VECT_CMP_CMP2       173
#define VECT_RIIC0_EEI0     194
#define VECT_RIIC0_RXI0     195
#define VECT_RIIC0_TXI0     196
#define VECT_RIIC0_TEI0     197
#define VECT_DMAC_DMAC0I    198
#define VECT_DMAC_DMAC1I    199
#define VECT_DMAC_DMAC2I    200
#define VECT_DMAC_DMAC3I    201
#define VECT_SCI0_RXI0      214
#define VECT_SCI0_TXI0      215
#define VECT_SCI0_TEI0      216
#define VECT_SCI1_RXI1      217
#define VECT_SCI1_TXI1      218
#define VECT_SCI1_TEI1      219
#define VECT_GPT0_GTCIA0    226
#define VECT_GPT0_GTCIB0    227
#define VECT_GPT0_GTCIC0    228
#define VECT_GPT0_GTCIE0    229
#define VECT_GPT0_GTCIV0    230
#define VECT_GPT0_LOCOI     231
#define VECT_GPT1_GTCIA1    232
#define VECT_GPT1_GTCIB1    233
#define VECT_GPT1_GTCIC1    234
#define VECT_GPT1_GTCIE1    235
#define VECT_GPT1_GTCIV1    236
#define VECT_GPT2_GTCIA2    238
#define VECT_GPT2_GTCIB2    239
#define VECT_GPT2_GTCIC2    240
#define VECT_GPT2_GTCIE2    241
#define VECT_GPT2_GTCIV2    242
#define VECT_GPT3_GTCIA3    244
#define VECT_GPT3_GTCIB3    245
#define VECT_GPT3_GTCIC3    246
#define VECT_GPT3_GTCIE3    247
#define VECT_GPT3_GTCIV3    248
#define VECT_SCI12_RXI12    250
#define VECT_SCI12_TXI12    251
#define VECT_SCI12_TEI12    252

#define MSTP_DMAC   SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC0  SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC1  SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC2  SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC3  SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DTC    SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_S12AD  SYSTEM.MSTPCRA.BIT.MSTPA17
#define MSTP_CMT0   SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT1   SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT2   SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_CMT3   SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_MTU7   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU6   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU5   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU4   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU3   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU2   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU1   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU0   SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU    SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_GPT3   SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT2   SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT1   SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT0   SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_GPT    SYSTEM.MSTPCRA.BIT.MSTPA7
#define MSTP_SCI0   SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SMCI0  SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SCI1   SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SMCI1  SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_CRC    SYSTEM.MSTPCRB.BIT.MSTPB23
#define MSTP_RIIC0  SYSTEM.MSTPCRB.BIT.MSTPB21
#define MSTP_RSPI0  SYSTEM.MSTPCRB.BIT.MSTPB17
#define MSTP_DOC    SYSTEM.MSTPCRB.BIT.MSTPB6
#define MSTP_SCI12  SYSTEM.MSTPCRB.BIT.MSTPB4
#define MSTP_SMCI12 SYSTEM.MSTPCRB.BIT.MSTPB4
#define MSTP_CAC    SYSTEM.MSTPCRC.BIT.MSTPC19
#define MSTP_RAM0   SYSTEM.MSTPCRC.BIT.MSTPC0

#define IS_SCI0_ERI0        IS0
#define IS_SCI1_ERI1        IS1
#define IS_SCI12_ERI12      IS4
#define IS_RSPI0_SPEI0      IS5

#define EN_SCI0_ERI0        EN0
#define EN_SCI1_ERI1        EN1
#define EN_SCI12_ERI12      EN4
#define EN_RSPI0_SPEI0      EN5

#define __IR( x )       ICU.IR[ IR ## x ].BIT.IR
#define  _IR( x )       __IR( x )
#define   IR( x , y )   _IR( _ ## x ## _ ## y )
#define __DTCE( x )     ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define  _DTCE( x )     __DTCE( x )
#define   DTCE( x , y ) _DTCE( _ ## x ## _ ## y )
#define __IEN( x )      ICU.IER[ IER ## x ].BIT.IEN ## x
#define  _IEN( x )      __IEN( x )
#define   IEN( x , y )  _IEN( _ ## x ## _ ## y )
#define __IPR( x )      ICU.IPR[ IPR ## x ].BIT.IPR
#define  _IPR( x )      __IPR( x )
#define   IPR( x , y )  _IPR( _ ## x ## _ ## y )
#define __VECT( x )     VECT ## x
#define  _VECT( x )     __VECT( x )
#define   VECT( x , y ) _VECT( _ ## x ## _ ## y )
#define __MSTP( x )     MSTP ## x
#define  _MSTP( x )     __MSTP( x )
#define   MSTP( x )     _MSTP( _ ## x )

#define __IS( x )       ICU.GRP[ GRP ## x ].BIT.IS ## x
#define  _IS( x )       __IS( x )
#define   IS( x , y )   _IS( _ ## x ## _ ## y )
#define __EN( x )       ICU.GEN[ GEN ## x ].BIT.EN ## x
#define  _EN( x )       __EN( x )
#define   EN( x , y )   _EN( _ ## x ## _ ## y )

#define TMOCNTL SARL0
#define TMOCNTU SARU0

#define BSC     (*(volatile struct st_bsc    __evenaccess *)0x81300)
#define CAC     (*(volatile struct st_cac    __evenaccess *)0x8B000)
#define CMT     (*(volatile struct st_cmt    __evenaccess *)0x88000)
#define CMT0    (*(volatile struct st_cmt0   __evenaccess *)0x88002)
#define CMT1    (*(volatile struct st_cmt0   __evenaccess *)0x88008)
#define CMT2    (*(volatile struct st_cmt0   __evenaccess *)0x88012)
#define CMT3    (*(volatile struct st_cmt0   __evenaccess *)0x88018)
#define CRC     (*(volatile struct st_crc    __evenaccess *)0x88280)
#define DMAC    (*(volatile struct st_dmac   __evenaccess *)0x82200)
#define DMAC0   (*(volatile struct st_dmac0  __evenaccess *)0x82000)
#define DMAC1   (*(volatile struct st_dmac1  __evenaccess *)0x82040)
#define DMAC2   (*(volatile struct st_dmac1  __evenaccess *)0x82080)
#define DMAC3   (*(volatile struct st_dmac1  __evenaccess *)0x820C0)
#define DOC     (*(volatile struct st_doc    __evenaccess *)0x8B080)
#define DTC     (*(volatile struct st_dtc    __evenaccess *)0x82400)
#define FLASH   (*(volatile struct st_flash  __evenaccess *)0x8C296)
#define GPT     (*(volatile struct st_gpt    __evenaccess *)0xC2000)
#define GPT0    (*(volatile struct st_gpt0   __evenaccess *)0xC2100)
#define GPT1    (*(volatile struct st_gpt0   __evenaccess *)0xC2180)
#define GPT2    (*(volatile struct st_gpt0   __evenaccess *)0xC2200)
#define GPT3    (*(volatile struct st_gpt0   __evenaccess *)0xC2280)
#define ICU     (*(volatile struct st_icu    __evenaccess *)0x87000)
#define IWDT    (*(volatile struct st_iwdt   __evenaccess *)0x88030)
#define MPC     (*(volatile struct st_mpc    __evenaccess *)0x8C11F)
#define MPU     (*(volatile struct st_mpu    __evenaccess *)0x86400)
#define MTU     (*(volatile struct st_mtu    __evenaccess *)0xC120A)
#define MTU0    (*(volatile struct st_mtu0   __evenaccess *)0xC1300)
#define MTU1    (*(volatile struct st_mtu1   __evenaccess *)0xC1380)
#define MTU2    (*(volatile struct st_mtu2   __evenaccess *)0xC1400)
#define MTU3    (*(volatile struct st_mtu3   __evenaccess *)0xC1200)
#define MTU4    (*(volatile struct st_mtu4   __evenaccess *)0xC1200)
#define MTU5    (*(volatile struct st_mtu5   __evenaccess *)0xC1C80)
#define MTU6    (*(volatile struct st_mtu3   __evenaccess *)0xC1A00)
#define MTU7    (*(volatile struct st_mtu7   __evenaccess *)0xC1A00)
#define POE     (*(volatile struct st_poe    __evenaccess *)0x8C4C0)
#define PORT0   (*(volatile struct st_port0  __evenaccess *)0x8C000)
#define PORT1   (*(volatile struct st_port1  __evenaccess *)0x8C001)
#define PORT2   (*(volatile struct st_port2  __evenaccess *)0x8C002)
#define PORT3   (*(volatile struct st_port3  __evenaccess *)0x8C003)
#define PORT4   (*(volatile struct st_port4  __evenaccess *)0x8C044)
#define PORT7   (*(volatile struct st_port7  __evenaccess *)0x8C007)
#define PORT9   (*(volatile struct st_port9  __evenaccess *)0x8C009)
#define PORTA   (*(volatile struct st_porta  __evenaccess *)0x8C00A)
#define PORTB   (*(volatile struct st_portb  __evenaccess *)0x8C00B)
#define PORTD   (*(volatile struct st_portd  __evenaccess *)0x8C00D)
#define PORTE   (*(volatile struct st_porte  __evenaccess *)0x8C04E)
#define RIIC0   (*(volatile struct st_riic   __evenaccess *)0x88300)
#define RSPI0   (*(volatile struct st_rspi   __evenaccess *)0x88380)
#define S12AD   (*(volatile struct st_s12ad  __evenaccess *)0x89000)
#define SCI0    (*(volatile struct st_sci0   __evenaccess *)0x8A000)
#define SCI1    (*(volatile struct st_sci0   __evenaccess *)0x8A020)
#define SCI12   (*(volatile struct st_sci12  __evenaccess *)0x8B300)
#define SMCI0   (*(volatile struct st_smci0  __evenaccess *)0x8A000)
#define SMCI1   (*(volatile struct st_smci0  __evenaccess *)0x8A020)
#define SMCI12  (*(volatile struct st_smci12 __evenaccess *)0x8B300)
#define SYSTEM  (*(volatile struct st_system __evenaccess *)0x80000)
#define WDT     (*(volatile struct st_wdt    __evenaccess *)0x88020)
#pragma bit_order
#pragma packoption
#endif